call = int(input("Количество минут: "))
call2 = 0
sms = int(input("Количество sms-сообщений: "))
sms2 = 0
dop = 0
nal = 0
if sms <= 50 and call <= 50:
    print("Базовая сумма тарификации: 15,00$")
    print("Сумма отчислений кол-центрам 911: 0,44$")
    print("Налог:", "%.2f" % ((15 + 0.44) * 0.05), "$")
    print("Итоговая сумма к оплате:", "%.2f" % (15 + (15 + 0.44) * 0.05), "$")
elif sms > 50 or call > 50:
    if sms > 50:
        sms2 = sms - 50
    if call > 50:
        talk2 = call - 50
    dop = ((sms2 * 0.15) + (call2 * 0.25))
    nal = ((15 + 0.44 + dop) * 0.05)
    print("Базовая сумма тарификации: 15,00$")
    print("Сумма за дополнительные минуты и sms-сообщения:", "%.2f" % dop, "$")
    print("Сумма отчислений кол-центрам 911: 0,44$")
    print("Налог:", "%.2f" % nal, "$")
    print("Итоговая сумма к оплате:", "%.2f" % (15 + 0.44 + dop + nal), "$")

# Evaluation: OK