import math
a = int(input("введите первое число: "))
b = int(input("введите второе число: "))

print("сумма чисел равна:", a + b)
print("разница между числами равна:", a - b,)
print("произведение этих чисел равно:", a * b)
print("частное от деления одного числа на другое равно:", a / b)
print("остаток от деления одного числа на другое равно:", a % b)
print("десятичный логарифм первого числа равен:", math.log10(a))
print("результат возведения первого числа в степень второго числа:", a ** b)

# Evaluation: OK