a = str(input("Введите название месяца "))
if a == "Январь":
    print("В этом месяце 31 день")
elif a == "Февраль":
    print("В этом месяце  28 дней, 29 дней, если год високосный")
elif a == "Март":
    print("В этом месяце 31 день")
elif a == "Апрель":
    print("В этом месяце 30 дней")
elif a == "Май":
    print("В этом месяце 31 день")
elif a == "Июнь":
    print("В этом месяце 30 дней")
elif a == "Июль":
    print("В этом месяце 31 день")
elif a == "Август":
    print("В этом месяце 31 день")
elif a == "Сентябрь":
    print("В этом месяце 30 дней")
elif a == "Октябрь":
    print("В этом месяце 31 день")
elif a == "Ноябрь":
    print("В этом месяце 30 дней")
elif a == "Декабрь":
    print("В этом месяце 31 день")
else:
    print: "Ошибка"
