a = input("Введите букву латинского алфавита")
if a == "a":
    print("Это гласная буква")
elif a == "e":
    print("Это гласная буква")
elif a == "i":
    print("Это гласная буква")
elif a == "o":
    print("Это гласная буква")
elif a == "u":
    print("Это гласная буква")
elif a == "e":
    print("Это гласная буква")
elif a == "y":
    print("Может быть как гласной, так и согласной")
else:
    print("Это согласная буква")

# Evaluation: OK. Слишком много лишних строк, надо было усложнить условие, сокращая количество кода.