n = input("Введите название месяца: ")
if n == 'Январь':
    print("В этом месяце 31 день")
elif n == 'Февраль':
    print("В этом месяце 28 или 29 дней, в зависимости от того не високосный или високосный год соответсвенно")
elif n == 'Март':
    print("В этом месяце 31 день")
elif n == 'Апрель':
    print("В этом месяце 30 дней")
elif n == 'Май':
    print("В этом месяце 31 день")
elif n == 'Июнь':
    print("В этом месяце 30 дней")
elif n == 'Июль':
    print("В этом месяце 31 день")
elif n == 'Август':
    print("В этом месяце 31 день")
elif n == 'Сентябрь':
    print("В этом месяце 30 дней")
elif n == 'Октябрь':
    print("В этом месяце 31 день")
elif n == 'Ноябрь':
    print("В этом месяце 30 дней")
elif n == 'Декабрь':
    print("В этом месяце 31 день")
else:
    print("Месяц написан неправильно - попробуй ещё раз (с заглавной буквы)!")