# (цикл for)
import simple_draw
sd.resolution = (2000, 1000)
start_x = 0
start_y = 0
long = 100
height = 50



# Нарисовать стену из кирпичей. Размер кирпича - 100х50
# Использовать вложенные циклы for

#
# Подсказки:
#  Для отрисовки кирпича использовать функцию rectangle
#  Алгоритм должен получиться приблизительно такой:
#
#   цикл по координате Y
#       вычисляем сдвиг ряда кирпичей
#       цикл координате X
#           вычисляем правый нижний и левый верхний углы кирпича
#           рисуем кирпич

simple_draw.pause()
