# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["Мама""Папа""Брат"]


# список списков приблизителного роста членов вашей семьи
my_family_height = "Мама 170, Папа 182, Брат 110 "
    # ['имя', рост],
    #[],
#]
# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print("Рост отца:",my_family_height[15:18])
print("Общий рост моей семьи:",170+182+110)#????????
# Пример вывода на консоль:
# Общий рост моей семьи - ХХ см
